arywk40-hue/DP-IC-202-/firmware/sdkconfig.defaults
#
# ESP-IDF sdkconfig.defaults for Environmental Hazard Detection Node
# Target: ESP32-S3
#
# These defaults produce a minimal working build for Phase 1.
# Adjust as needed for production (enable Wi-Fi/Bluetooth if required).
#

# Target chip
CONFIG_IDF_TARGET="esp32s3"

# FreeRTOS
CONFIG_FREERTOS_HZ=100
CONFIG_FREERTOS_TICK_RATE_SOURCE_SYSTIMER=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=n

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASH_FREQ_80M=y
CONFIG_ESPTOOLPY_FLASH_MODE_QIO=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3
CONFIG_LOG_TIMESTAMP_SOURCE_RTOS=y

# Compiler optimizations
CONFIG_OPTIMIZATION_LEVEL_RELEASE=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Watchdog
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_PANIC=n

# I2C
CONFIG_I2C_MASTER_ENABLE=y

# SPI
CONFIG_SPI_MASTER_ENABLE=y

# UART
CONFIG_UART_ENABLE=y

# NVS
CONFIG_NVS_ENABLED=y

# Minimal memory
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y

# Disable unused features
CONFIG_BT_ENABLED=n
CONFIG_ETH_ENABLED=n
CONFIG_WIFI_ENABLED=n
CONFIG_LWIP_ENABLED=n
